---
ХРАНИЛИЩЕ_ОБЪЕКТОВ
выражен1 : _genAE(5);
код1 : _getAEcode();

выражен2 : _genAE(5);
код2 : _getAEcode();

выражен3 : _genAE(5);
код3 : _getAEcode();

выражен4 : _genAE(5);
код4 : _getAEcode();

x1 : _rnd(0.0 | 5.0 | double);
x2 : _rnd( 5.0 | 10.0 | double);
x3 : _rnd( 10.0 | 15.0 | double);

---
ШАБЛОННЫЙ_ВИД
написать программу для вычисления выражения
(выражен1) где x < (x1)
(выражен2) где (x1) <= x < (x2)
(выражен3) где (x2) <= x < (x3)
(выражен4) где x >= (x3)
---
РЕШЕНИЕ
#include <cmath>
#include <iostream>

using namespace std;

int main()
{
    double var = 0.0;
    double x;
    cin >> x;

    if ( x < (x1))
    {
        (код1);
    }

    else if (x >= (x1) && x < (x2))
    {
        (код2);
    }

    else if (x >= (x2) && x < (x3))
    {
    	(код3);
    }

    else if (x >= (x3))
    {
        (код4);
    }

    cout << var;

    return 0;

}
---
СЛУЖЕБНОЕ
знаки_арифм : +, -, *, /;
функции_арифм : sin, cos, sqrt, log, log10;

---
ТЕСТОВЫЕ_ДАННЫЕ
тест1 : _rnd((x1) | 20.0 | double | 10);
тест2 : _rnd((x1) | 20.0 | double | 10);
тест3 : 1,2,3,4,5,6,7,8,9,10;
---